app/controllers/transactions_controller.rb

  def create
    @transaction = Transaction.new(transaction_params)

    if @transaction.save
---
INSERT INTO "transactions" ("title", "value", "created_at", "updated_at", "notes", "account") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Test 154"], ["value", 10024.0], ["created_at", "2021-09-26 08:06:19.111922"], ["updated_at", "2021-09-26 08:06:19.111922"], ["notes", ""], ["account", "Bank"]]

  def show
    @transaction = Transaction.find(params[:id])
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def edit
    @transaction = Transaction.find(params[:id])
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @transaction = Transaction.find(params[:id])

    if @transaction.update(transaction_params)
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "transactions" SET "updated_at" = ?, "notes" = ?, "account" = ? WHERE "transactions"."id" = ?  [["updated_at", "2021-09-26 10:39:18.554215"], ["notes", ""], ["account", "Cash"], ["id", 1]]

  def destroy
    @transaction = Transaction.find(params[:id])
    @transaction.destroy
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "transactions" WHERE "transactions"."id" = ?  [["id", 5]]

  def ledger_balance
    @ledgers.each do |ledger|
        ledger.balance = ledger.transactions.sum(:value)
---
SELECT "transactions".* FROM "transactions"