app/views/transactions/index.html.erb

        <% @ledgers.each do |ledger| %>
            <p><strong><%= ledger.title %> Balance: </strong><%= ledger.transactions.sum(:value) %>TND</p>
---
SELECT "transactions".* FROM "transactions"